---
kind: method
id: M:Autodesk.Revit.DB.Plumbing.IPipeFittingAndAccessoryPressureDropServer.Calculate(Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryPressureDropData)
source: html/de0a343d-70e3-ad31-9895-4affd1c5beff.htm
---
# Autodesk.Revit.DB.Plumbing.IPipeFittingAndAccessoryPressureDropServer.Calculate Method

Calculate the pipe fitting and pipe accessory coefficient.

## Syntax (C#)
```csharp
bool Calculate(
	PipeFittingAndAccessoryPressureDropData data
)
```

## Parameters
- **data** (`Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryPressureDropData`) - The input and output data of the calculation.

## Returns
True if calculation succeeds.
 False if calculation fails.